packages/test/src/m3/diagrams/test-diagram-expected.puml
@startuml
hide empty members

' qualified name: "test"


annotation Annotation1
Annotation1 --> Node

class Concept1 {
  prop1: CustomPrimitive?
}

class "CustomPrimitive" <<primitive type>>


' relations:


Concept1 "*" -- "*" Concept1: selfRefs
Concept1 "*" -- "1" Node: nodeTargets


@enduml
